IDEA Open Model
ConcreteBlockData.OriginalModelId Property
Compatible with IDEA StatiCa Beta 20.0
 Get or set the identification in the original model In the case of the imported connection from another application
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public string OriginalModelId { get; set; }
Public Property OriginalModelId As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ConcreteBlockData Class
IdeaRS.OpenModel.Connection Namespace